RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_rtc.h
  uint8_t Date;     /*!< Specifies the RTC Date.
                         This parameter must be a number between Min_Data = 1 and Max_Data = 31 */

  uint8_t Year;     /*!< Specifies the RTC Date Year.
                         This parameter must be a number between Min_Data = 0 and Max_Data = 99 */
} RTC_DateTypeDef;

/**
  * @brief  RTC Alarm structure definition
  */
typedef struct
{
  RTC_TimeTypeDef AlarmTime;     /*!< Specifies the RTC Alarm Time members */

  uint32_t AlarmMask;            /*!< Specifies the RTC Alarm Masks.
                                      This parameter can be a value of @ref RTC_AlarmMask_Definitions */

  uint32_t AlarmSubSecondMask;   /*!< Specifies the RTC Alarm SubSeconds Masks.
                                      if Binary mode is RTC_BINARY_ONLY or is RTC_BINARY_MIX
                                        This parameter can be a value of
                                        @ref RTCEx_Alarm_Sub_Seconds_binary_Masks_Definitions
                                      else if Binary mode is RTC_BINARY_NONE
                                        This parameter can be a value of
                                        @ref RTC_Alarm_Sub_Seconds_Masks_Definitions */

  uint32_t BinaryAutoClr;        /*!< Clear synchronously counter (RTC_SSR) on binary alarm.
                                      RTC_ALARMSUBSECONDBIN_AUTOCLR_YES must only be used if Binary mode
                                       is RTC_BINARY_ONLY
                                      This parameter can be a value of
                                      @ref RTCEx_Alarm_Sub_Seconds_binary_Clear_Definitions */

  uint32_t AlarmDateWeekDaySel;  /*!< Specifies the RTC Alarm is on Date or WeekDay.
                                     This parameter can be a value of @ref RTC_AlarmDateWeekDay_Definitions */

  uint8_t AlarmDateWeekDay;      /*!< Specifies the RTC Alarm Date/WeekDay.
                                      If the Alarm Date is selected, this parameter must be set to a value
                                       in the 1-31 range.
                                      If the Alarm WeekDay is selected, this parameter can be a value of
                                      @ref RTC_WeekDay_Definitions */

  uint32_t FlagAutoClr;          /*!< Specifies the alarm trigger generation. This feature is meaningful
                                      to avoid any RTC software execution after configuration.
                                      This parameter can be a value of @ref RTC_ALARM_Flag_AutoClear_Definitions */

  uint32_t Alarm;                /*!< Specifies the alarm .
                                      This parameter can be a value of @ref RTC_Alarms_Definitions */
} RTC_AlarmTypeDef;

/**
  * @brief  RTC Handle Structure definition
  */
#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
typedef struct __RTC_HandleTypeDef
#else
typedef struct
#endif /* (USE_HAL_RTC_REGISTER_CALLBACKS) */
{
  RTC_TypeDef               *Instance;  /*!< Legacy register base address. Not used anymore, the driver directly uses cmsis base address */

  RTC_InitTypeDef           Init;       /*!< RTC required parameters  */

  HAL_LockTypeDef           Lock;       /*!< RTC locking object       */

  __IO HAL_RTCStateTypeDef  State;      /*!< Time communication state */

#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
  void (* AlarmAEventCallback)(struct __RTC_HandleTypeDef *hrtc);                    /*!< RTC Alarm A Event callback            */
  void (* AlarmBEventCallback)(struct __RTC_HandleTypeDef *hrtc);                    /*!< RTC Alarm B Event callback            */
  void (* TimeStampEventCallback)(struct __RTC_HandleTypeDef *hrtc);                 /*!< RTC TimeStamp Event callback          */
  void (* WakeUpTimerEventCallback)(struct __RTC_HandleTypeDef *hrtc);               /*!< RTC WakeUpTimer Event callback        */
  void (* SSRUEventCallback)(struct __RTC_HandleTypeDef *hrtc);                      /*!< RTC SSRU Event callback               */
  void (* Tamper1EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 1 Event callback           */
  void (* Tamper2EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 2 Event callback           */
  void (* Tamper3EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 3 Event callback           */
  void (* Tamper4EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 4 Event callback           */
  void (* Tamper5EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 5 Event callback           */
  void (* Tamper6EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 6 Event callback           */
  void (* Tamper7EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 7 Event callback           */
  void (* Tamper8EventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Tamper 8 Event callback           */
  void (* InternalTamper1EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 1 Event callback   */
  void (* InternalTamper2EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 2 Event callback   */
  void (* InternalTamper3EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 3 Event callback   */
  void (* InternalTamper5EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 5 Event callback   */
  void (* InternalTamper6EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 6 Event callback   */
  void (* InternalTamper7EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 7 Event callback   */
  void (* InternalTamper8EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 8 Event callback   */
  void (* InternalTamper9EventCallback)(struct __RTC_HandleTypeDef *hrtc);           /*!< RTC Internal Tamper 9 Event callback   */
  void (* InternalTamper11EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 11 Event callback  */
  void (* InternalTamper12EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 12 Event callback   */
  void (* InternalTamper13EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 13 Event callback  */
  void (* MspInitCallback)(struct __RTC_HandleTypeDef *hrtc);                        /*!< RTC Msp Init callback                 */
  void (* MspDeInitCallback)(struct __RTC_HandleTypeDef *hrtc);                      /*!< RTC Msp DeInit callback               */

#endif /* (USE_HAL_RTC_REGISTER_CALLBACKS) */

} RTC_HandleTypeDef;

#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL RTC Callback ID enumeration definition
  */
typedef enum
{
  HAL_RTC_ALARM_A_EVENT_CB_ID             = 0U,     /*!< RTC Alarm A Event Callback ID       */
  HAL_RTC_ALARM_B_EVENT_CB_ID             = 1U,     /*!< RTC Alarm B Event Callback ID       */
  HAL_RTC_TIMESTAMP_EVENT_CB_ID           = 2U,     /*!< RTC TimeStamp Event Callback ID     */
  HAL_RTC_WAKEUPTIMER_EVENT_CB_ID         = 3U,     /*!< RTC WakeUp Timer Event Callback ID  */
  HAL_RTC_SSRU_EVENT_CB_ID                = 4U,     /*!< RTC SSRU Event Callback ID          */
  HAL_RTC_TAMPER1_EVENT_CB_ID             = 5U,     /*!< RTC Tamper 1 Callback ID            */
  HAL_RTC_TAMPER2_EVENT_CB_ID             = 6U,     /*!< RTC Tamper 2 Callback ID            */
  HAL_RTC_TAMPER3_EVENT_CB_ID             = 7U,     /*!< RTC Tamper 3 Callback ID            */
  HAL_RTC_TAMPER4_EVENT_CB_ID             = 8U,     /*!< RTC Tamper 4 Callback ID            */
  HAL_RTC_TAMPER5_EVENT_CB_ID             = 9U,     /*!< RTC Tamper 5 Callback ID            */
  HAL_RTC_TAMPER6_EVENT_CB_ID             = 10U,    /*!< RTC Tamper 6 Callback ID            */
  HAL_RTC_TAMPER7_EVENT_CB_ID             = 11U,    /*!< RTC Tamper 7 Callback ID            */
  HAL_RTC_TAMPER8_EVENT_CB_ID             = 12U,    /*!< RTC Tamper 8 Callback ID            */
  HAL_RTC_INTERNAL_TAMPER1_EVENT_CB_ID    = 13U,    /*!< RTC Internal Tamper 1 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER2_EVENT_CB_ID    = 14U,    /*!< RTC Internal Tamper 2 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER3_EVENT_CB_ID    = 15U,    /*!< RTC Internal Tamper 3 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER5_EVENT_CB_ID    = 16U,    /*!< RTC Internal Tamper 5 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER6_EVENT_CB_ID    = 17U,    /*!< RTC Internal Tamper 6 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER7_EVENT_CB_ID    = 18U,    /*!< RTC Internal Tamper 7 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER8_EVENT_CB_ID    = 19U,    /*!< RTC Internal Tamper 8 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER9_EVENT_CB_ID    = 20U,    /*!< RTC Internal Tamper 9 Callback ID   */
  HAL_RTC_INTERNAL_TAMPER11_EVENT_CB_ID   = 21U,    /*!< RTC Internal Tamper 11 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER12_EVENT_CB_ID   = 22U,    /*!< RTC Internal Tamper 12 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER13_EVENT_CB_ID   = 23U,    /*!< RTC Internal Tamper 13 Callback ID  */
  HAL_RTC_MSPINIT_CB_ID                   = 24U,    /*!< RTC Msp Init callback ID            */
  HAL_RTC_MSPDEINIT_CB_ID                 = 25U     /*!< RTC Msp DeInit callback ID          */
} HAL_RTC_CallbackIDTypeDef;

/**
  * @brief  HAL RTC Callback pointer definition
  */
typedef  void (*pRTC_CallbackTypeDef)(RTC_HandleTypeDef *hrtc);  /*!< pointer to an RTC callback function */
#endif /* USE_HAL_RTC_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RTC_Exported_Constants RTC Exported Constants
  * @{
  */

/** @defgroup RTC_Hour_Formats RTC Hour Formats
  * @{
  */
#define RTC_HOURFORMAT_24                   0x00000000u
#define RTC_HOURFORMAT_12                   RTC_CR_FMT
/**
  * @}
  */

